# Напишите программу, которая запрашивает у пользователя натуральное число, а затем печатает его цифру
# начиная с конца, на отдельной строке.

print('Задача 16\n')

numberint = int(input('Введите натуральное число: '))

#numberstr = str(numberint)
#if numberstr == '':
#    print('+')
#else:
#    numberstr-=1

# Задача не решена))))