# Новая задача глава 4, задача 13, под названием разработка

# Напишите программу, которая подсчитывает количество ячеек в таблице, содержащий 5 строк и 2 столбца. При этом:

a=2
b=5
for i in range(a):
    i+=1

    for j in range(b):
        j+=1
        print(i,' ',j)