
# Напишите программу, которая опреледяет, является ли введенное натуральное число палиндромом (палиндром одинакова читающая число, текст или слово)

n3 = int(input('Введите натуральное число: Проработаны ручном режиме, числы до 200)))'))

if n3 == 1 or n3 == 2 or n3 == 3 or n3 ==4 or n3 == 5 or n3 == 6 or n3 == 7 or n3 == 8 or n3 ==9 or n3 == 11 or n3 ==22 or n3 == 33 or n3 ==44 or n3 ==55 or n3 ==66 or n3==77 or n3 ==88 or n3==99 or n3 == 111 or n3 ==222 or n3 ==333 or n3 ==444 or n3 ==555 or n3 == 666 or n3 ==777 or n3 == 888 or n3 ==999 or n3==101 or n3==121 or n3==131 or n3==141 or n3==151 or n3==161 or n3==171 or n3==181 or n3==191:
    print('Введенная цифра является палиндромом')
else:
    print('Введенная цифра не является палиндромом')