# Напишите программу, показывающую пользователю символы, которые можно использовать для сложения, умножения, 
# вычитания и деления, затем предлагает ввести арифметическое 
# выражение и вычисляет его. В задаче используйте: функцию 
# eval(), переход на следующую строку \n, тройные кавычки.

arifmetika = eval(input('Введите выражение: к примеру, 2+3 или 3*5 или 15/3:\n'))

print('Итого',arifmetika)

# -3*3+3
#Ответ: -6